Meshes & Solutions/polygon-4/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       7840;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       7880;
    }
    polygon
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          40;
        startFace       7920;
    }
    top
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          4000;
        startFace       7960;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          4000;
        startFace       11960;
    }
    outside
    {
        type            patch;
        nFaces          200;
        startFace       15960;
    }
)

// ************************************************************************* //
