Meshes & Solutions/polygon-4/system/blockMeshDict
// File generated on 04-27-2024

// # Sides: 4
// Diameter: 1
// Foreground: 4
// Wake: 10
// Width: 4
// Height: 0.1
// Resolution: 10

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
                   
convertToMeters 1;

vertices
(
		 ( 6.0                 4                   0.05  ) // 0  
		 ( 6.0                 2.5                 0.05  ) // 1  
		 ( 6.5                 2.0                 0.05  ) // 2  
		 ( 6.5                 4                   0.05  ) // 3  
		 ( 5.5                 4                   0.05  ) // 4  
		 ( 5.5                 2.0                 0.05  ) // 5  
		 ( 6.0                 0                   0.05  ) // 6  
		 ( 6.0                 1.5                 0.05  ) // 7  
		 ( 5.5                 0                   0.05  ) // 8  
		 ( 6.5                 0                   0.05  ) // 9  
		 ( 0                   2.0                 0.05  ) // 10 
		 ( 0                   0                   0.05  ) // 11 
		 ( 18                  0                   0.05  ) // 12 
		 ( 18                  2.0                 0.05  ) // 13 
		 ( 0                   4                   0.05  ) // 14 
		 ( 18                  4                   0.05  ) // 15 
		 ( 6.0                 4                   -0.05 ) // 16 
		 ( 6.0                 2.5                 -0.05 ) // 17 
		 ( 6.5                 2.0                 -0.05 ) // 18 
		 ( 6.5                 4                   -0.05 ) // 19 
		 ( 5.5                 4                   -0.05 ) // 20 
		 ( 5.5                 2.0                 -0.05 ) // 21 
		 ( 6.0                 0                   -0.05 ) // 22 
		 ( 6.0                 1.5                 -0.05 ) // 23 
		 ( 5.5                 0                   -0.05 ) // 24 
		 ( 6.5                 0                   -0.05 ) // 25 
		 ( 0                   2.0                 -0.05 ) // 26 
		 ( 0                   0                   -0.05 ) // 27 
		 ( 18                  0                   -0.05 ) // 28 
		 ( 18                  2.0                 -0.05 ) // 29 
		 ( 0                   4                   -0.05 ) // 30 
		 ( 18                  4                   -0.05 ) // 31 
);

blocks
(
		hex (16  17  18  19  0   1   2   3  ) (20 10 1) simpleGrading (1 1 1) // 0
		hex (20  21  17  16  4   5   1   0  ) (20 10 1) simpleGrading (1 1 1) // 1
		hex (22  23  21  24  6   7   5   8  ) (20 10 1) simpleGrading (1 1 1) // 2
		hex (25  18  23  22  9   2   7   6  ) (20 10 1) simpleGrading (1 1 1) // 3
		hex (24  21  26  27  8   5   10  11 ) (20 20 1) simpleGrading (1 1 1) // 4
		hex (28  29  18  25  12  13  2   9  ) (20 60 1) simpleGrading (1 1 1) // 5
		hex (30  26  21  20  14  10  5   4  ) (20 20 1) simpleGrading (1 1 1) // 6
		hex (19  18  29  31  3   2   13  15 ) (20 60 1) simpleGrading (1 1 1) // 7
);

edges
(
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(27  11  10  26 )
			(26  10  14  30 )
		);
	}

	outlet
	{
		type patch;
		faces
		(
			(29  13  12  28 )
			(31  15  13  29 )
		);
	}

	polygon
	{
		type wall;
		faces
		(
			(18  2   1   17 )
			(21  5   1   17 )
			(23  7   5   21 )
			(23  7   2   18 )
		);
	}

	top
	{
		type symmetryPlane;
		faces
		(
			(0   1   2   3  )
			(4   5   1   0  )
			(6   7   5   8  )
			(9   2   7   6  )
			(8   5   10  11 )
			(12  13  2   9  )
			(14  10  5   4  )
			(3   2   13  15 )
		);
	}

	bottom
	{
		type symmetryPlane;
		faces
		(
			(16  17  18  19 )
			(20  21  17  16 )
			(22  23  21  24 )
			(25  18  23  22 )
			(24  21  26  27 )
			(28  29  18  25 )
			(30  26  21  20 )
			(19  18  29  31 )
		);
	}

	outside
	{
		type patch;
		faces
		(
			(19  3   0   16 )
			(16  0   4   20 )
			(24  8   6   22 )
			(22  6   9   25 )
			(24  8   11  27 )
			(28  12  9   25 )
			(30  14  4   20 )
			(19  3   15  31 )
		);
	}

);

mergePatchPairs
(
);

